{
  "subject": "Application for Information Management Roster",
  "recipient": "Hiring Manager",
  "paragraphs": [
    "I am writing to express my strong interest in joining the Danish Refugee Council (DRC) Information Management Roster. I have a solid background in humanitarian technology (including the responsible use of AI in humanitarian contexts), data management, and project coordination. I also have recent deployment experience in emergency response. I am confident in my ability to contribute effectively to DRC's mission in whatever context I might find myself in.",
    "Currently serving as a Humanitarian Project Coordinator at Kobo, I manage partnerships with key UN agencies, INGOs, and government bodies across various humanitarian contexts. My role involves extensive technical skills in building custom tools and the strategic implementation of data collection solutions. I have delivered specialized training workshops in both English and Spanish around the world, equipping teams with the tools needed for effective data management in the field.",
    "Most recently, in November 2025, I was deployed to Jamaica for two weeks to support the humanitarian response and recovery efforts following Hurricane Melissa. During this deployment, I worked closely with OCHA, UNDAC, IOM, WFP, MapAction, the Ministry of Labour and Social Security (MLSS) and others on the ground. My primary focus was on supporting emergency Information Management efforts in various forms and across all sectors.",
    "I also support Kobo as a Solutions Architect for AI integration into KoboToolbox and research into AI integration for humanitarian data collection, ensuring that we leverage cutting-edge technology responsibly. I am fluent in English and have professional proficiency in Spanish, which has allowed me to conduct trainings and coordinate projects across Latin America.",
    "I am deeply committed to humanitarian principles and eager to bring my technical skills and field experience to the DRC. I welcome the opportunity to discuss how my background aligns with the needs of the roster."
  ]
}
